# Day05 [ 기본함수, 람다, 고차 함수, 클래스]
#
#     1. 함수를 선언하고 매개인자를 이용한 데이터 전달을 이해하고 활용할 수 있다 com.test
#
#     2. 익명 형식을 통해서 함수를 활용할 수 있고 변환 할 수 있다. (익명 <-> 일반함수)com.test01
#
#     3. 람다식을 사용하는 모듈함수를 통해 고차함수를 활용하고 설명할 수 있다.
#
#     4. 클래스의 맴버를 이용해서 값 전달 및 변경 리턴하는 구조와 생성자와 소멸자를 이해하고 활용할 수 있다.
#
# ====================================================================================
# exam
#     exam01)calc.py : 사칙연산을 이용한 매개인자를 받아 리턴 하는 구조의 함수 선언
#         Mcalc.py : calc 모듈을 호출 해서 속성 값 확인, 모듈 별칭, dir()속성 정보 확인, 함수 호출 확인
#
# ====================================================================================